Documents/ESB/ESB_Consumer_0712/003TestSample/SAMPLE_XML_MUST/Loan/LO30_EarlyRepmtCalRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Loan/EarlyRepmtCalRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Loan</ServiceDomain>  
      <OperationName>EarlyRepmtCal</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:EarlyRepmtCalRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>LO30</v11:TxnId>  
        <v11:TxnNo>LO3000001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <v11:ProdId>STR</v11:ProdId>  
          <v11:Ccy>STR</v11:Ccy>  
          <v11:EffDate>STR</v11:EffDate>  
          <v11:CmmtmntInfo> 
            <v11:Amt>3500</v11:Amt>  
            <v11:LmtModFlg>STR</v11:LmtModFlg> 
          </v11:CmmtmntInfo> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:EarlyRepmtCalRq> 
  </soap:Body> 
</soap:Envelope>
